// -------------- 1 --------------
import {fun_1_1, fun_1_2, fun_1_3, fun_1_4} from "./StringMd.js"

// console.log('fun_1_1 -> ',fun_1_1('ues rughewrhg BUBUB'))
// console.log('fun_1_2 -> ',fun_1_2('Вот пример строки,в которой     используются знаки препинания.После знаков должны стоять пробелы , а перед знаками их быть не должно .    Если есть лишние подряд идущие пробелы, они должны быть устранены.'))
// console.log('fun_1_3 -> ',fun_1_3('Посдчитывающие кол-во слов'))
// console.log('fun_1_4 -> ',fun_1_4('Текст,в котором        котором ,  котором  . слово текст несколько раз встречается и слово тоже'))

// -------------- 2 --------------
import {Additions, Subtraction, multiplication, Division} from "./MathMd.js"

// console.log('2_1 ->',Additions(`
// 100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000`, 
// 15,5,3
// ));

// console.log('2_2 ->',Subtraction(`
// 100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000`, 
// 15,5,3
// ));

// console.log('2_3 ->',multiplication(`
// 100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000`, 
// 15,5,3
// ));

// console.log('2_4 ->',Division(`
// 100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000`, 
// 15,5,3
// ));


// -------------- 3 --------------

// let g = new Product()
// g.Add('fdrandom',2,8,'rand abc')
// g.Add('fd gavnukki',2,6,'rergergfdy hth')
// g.Add('dvnukfdki',8,8,'rergergfdy hth')
// g.Add('fd gavnukki',2,5,'rergergfdy abc')
// g.Add('fd Monika',2,10,'htrabc')

// console.log('3 ->',g.Search('name-contains-fd&price-=2&quantity->5&description-ends-abc'))